# Data Manipulation with Pandas

# Data Manipulation tasks:
    
- Filtering data

- Sorting data

- Group By aggregations

- Adding new columns

- Handling dates

- Handling Strings

- Merging dataframes

- Treating Missing Values

In [1]:
#import packages
import os
import pandas as pd
import numpy as np

In [2]:
#change the working directory
os.chdir("D://Files")

In [3]:
# load the data set 'stores'
store=pd.read_csv("Store.csv",encoding='latin')

In [4]:
#Number of observations
store.shape

(9994, 21)

In [5]:
#Information about the columns/variables in a data set
store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
Row ID           9994 non-null int64
Order ID         9994 non-null object
Order Date       9994 non-null object
Ship Date        9994 non-null object
Ship Mode        9994 non-null object
Customer ID      9994 non-null object
Customer Name    9994 non-null object
Segment          9994 non-null object
Country          9994 non-null object
City             9994 non-null object
State            9994 non-null object
Postal Code      9994 non-null int64
Region           9994 non-null object
Product ID       9994 non-null object
Category         9994 non-null object
Sub-Category     9994 non-null object
Product Name     9994 non-null object
Sales            9994 non-null float64
Quantity         9994 non-null int64
Discount         9994 non-null float64
Profit           9994 non-null float64
dtypes: float64(3), int64(3), object(15)
memory usage: 1.6+ MB

In [6]:
store.dtypes

Row ID             int64
Order ID          object
Order Date        object
Ship Date         object
Ship Mode         object
Customer ID       object
Customer Name     object
Segment           object
Country           object
City              object
State             object
Postal Code        int64
Region            object
Product ID        object
Category          object
Sub-Category      object
Product Name      object
Sales            float64
Quantity           int64
Discount         float64
Profit           float64
dtype: object

In [7]:
#First 3 observations from the dataset
store.head(3)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820
2,3,CA-2013-138688,6/13/2013,6/17/2013,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.62,2,0.0,6.8714

In [8]:
#last 2 observations from the data set
store.tail(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9992,9993,CA-2014-121258,2/27/2014,3/4/2014,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.60,4,0.0,13.320
9993,9994,CA-2014-119914,5/5/2014,5/10/2014,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.16,2,0.0,72.948

In [9]:
#Count the number of missing values
store.isnull().sum()

Row ID           0
Order ID         0
Order Date       0
Ship Date        0
Ship Mode        0
Customer ID      0
Customer Name    0
Segment          0
Country          0
City             0
State            0
Postal Code      0
Region           0
Product ID       0
Category         0
Sub-Category     0
Product Name     0
Sales            0
Quantity         0
Discount         0
Profit           0
dtype: int64

In [10]:
#Summary statistics for numerical variables
store.describe()

,Row ID,Postal Code,Sales,Quantity,Discount,Profit
count,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4997.500000,55190.379428,229.858001,3.789574,0.156203,28.656896
std,2885.163629,32063.693350,623.245101,2.225110,0.206452,234.260108
min,1.000000,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2499.250000,23223.000000,17.280000,2.000000,0.000000,1.728750
50%,4997.500000,56430.500000,54.490000,3.000000,0.200000,8.666500
75%,7495.750000,90008.000000,209.940000,5.000000,0.200000,29.364000
max,9994.000000,99301.000000,22638.480000,14.000000,0.800000,8399.976000

In [11]:
store[['Sales',"Postal Code"]].describe()

              Sales   Postal Code
count   9994.000000   9994.000000
mean     229.858001  55190.379428
std      623.245101  32063.693350
min        0.444000   1040.000000
25%       17.280000  23223.000000
50%       54.490000  56430.500000
75%      209.940000  90008.000000
max    22638.480000  99301.000000

In [12]:
# Finding out how many cities are the orders being delivered to
# We have to print the contents of the city column 
 
cities = store['City']
print(type(cities))
print(len(cities))

<class 'pandas.core.series.Series'>
9994

In [13]:
cities=store.City
print(len(cities))

9994

In [14]:
# In the below query, we are trying to find out how many unique cities are the packages delivered.
cities_uniq = store['City'].unique().tolist() # Note : The default type is array, unless u convert it to a list
print(type(cities_uniq))
print(cities_uniq)
len(cities_uniq)
#print(len(set(cities)))

<class 'list'>
['Henderson', 'Los Angeles', 'Fort Lauderdale', 'Concord', 'Seattle', 'Fort Worth', 'Madison', 'West Jordan', 'San Francisco', 'Fremont', 'Philadelphia', 'Orem', 'Houston', 'Richardson', 'Naperville', 'Melbourne', 'Eagan', 'Westland', 'Dover', 'New Albany', 'New York City', 'Troy', 'Chicago', 'Gilbert', 'Springfield', 'Jackson', 'Memphis', 'Decatur', 'Durham', 'Columbia', 'Rochester', 'Minneapolis', 'Portland', 'Saint Paul', 'Aurora', 'Charlotte', 'Orland Park', 'Urbandale', 'Columbus', 'Bristol', 'Wilmington', 'Bloomington', 'Phoenix', 'Roseville', 'Independence', 'Pasadena', 'Newark', 'Franklin', 'Scottsdale', 'San Jose', 'Edmond', 'Carlsbad', 'San Antonio', 'Monroe', 'Fairfield', 'Grand Prairie', 'Redlands', 'Hamilton', 'Westfield', 'Akron', 'Denver', 'Dallas', 'Whittier', 'Saginaw', 'Medina', 'Dublin', 'Detroit', 'Tampa', 'Santa Clara', 'Lakeville', 'San Diego', 'Brentwood', 'Chapel Hill', 'Morristown', 'Cincinnati', 'Inglewood', 'Tamarac', 'Colorado Springs', 'Belleville', 'Taylor', 'Lakewood', 'Arlington', 'Arvada', 'Hackensack', 'Saint Petersburg', 'Long Beach', 'Hesperia', 'Murfreesboro', 'Layton', 'Austin', 'Lowell', 'Manchester', 'Harlingen', 'Tucson', 'Quincy', 'Pembroke Pines', 'Des Moines', 'Peoria', 'Las Vegas', 'Warwick', 'Miami', 'Huntington Beach', 'Richmond', 'Louisville', 'Lawrence', 'Canton', 'New Rochelle', 'Gastonia', 'Jacksonville', 'Auburn', 'Norman', 'Park Ridge', 'Amarillo', 'Lindenhurst', 'Huntsville', 'Fayetteville', 'Costa Mesa', 'Parker', 'Atlanta', 'Gladstone', 'Great Falls', 'Lakeland', 'Montgomery', 'Mesa', 'Green Bay', 'Anaheim', 'Marysville', 'Salem', 'Laredo', 'Grove City', 'Dearborn', 'Warner Robins', 'Vallejo', 'Mission Viejo', 'Rochester Hills', 'Plainfield', 'Sierra Vista', 'Vancouver', 'Cleveland', 'Tyler', 'Burlington', 'Waynesboro', 'Chester', 'Cary', 'Palm Coast', 'Mount Vernon', 'Hialeah', 'Oceanside', 'Evanston', 'Trenton', 'Cottage Grove', 'Bossier City', 'Lancaster', 'Asheville', 'Lake Elsinore', 'Omaha', 'Edmonds', 'Santa Ana', 'Milwaukee', 'Florence', 'Lorain', 'Linden', 'Salinas', 'New Brunswick', 'Garland', 'Norwich', 'Alexandria', 'Toledo', 'Farmington', 'Riverside', 'Torrance', 'Round Rock', 'Boca Raton', 'Virginia Beach', 'Murrieta', 'Olympia', 'Washington', 'Jefferson City', 'Saint Peters', 'Rockford', 'Brownsville', 'Yonkers', 'Oakland', 'Clinton', 'Encinitas', 'Roswell', 'Jonesboro', 'Antioch', 'Homestead', 'La Porte', 'Lansing', 'Cuyahoga Falls', 'Reno', 'Harrisonburg', 'Escondido', 'Royal Oak', 'Rockville', 'Coral Springs', 'Buffalo', 'Boynton Beach', 'Gulfport', 'Fresno', 'Greenville', 'Macon', 'Cedar Rapids', 'Providence', 'Pueblo', 'Deltona', 'Murray', 'Middletown', 'Freeport', 'Pico Rivera', 'Provo', 'Pleasant Grove', 'Smyrna', 'Parma', 'Mobile', 'New Bedford', 'Irving', 'Vineland', 'Glendale', 'Niagara Falls', 'Thomasville', 'Westminster', 'Coppell', 'Pomona', 'North Las Vegas', 'Allentown', 'Tempe', 'Laguna Niguel', 'Bridgeton', 'Everett', 'Watertown', 'Appleton', 'Bellevue', 'Allen', 'El Paso', 'Grapevine', 'Carrollton', 'Kent', 'Lafayette', 'Tigard', 'Skokie', 'Plano', 'Suffolk', 'Indianapolis', 'Bayonne', 'Greensboro', 'Baltimore', 'Kenosha', 'Olathe', 'Tulsa', 'Redmond', 'Raleigh', 'Muskogee', 'Meriden', 'Bowling Green', 'South Bend', 'Spokane', 'Keller', 'Port Orange', 'Medford', 'Charlottesville', 'Missoula', 'Apopka', 'Reading', 'Broomfield', 'Paterson', 'Oklahoma City', 'Chesapeake', 'Lubbock', 'Johnson City', 'San Bernardino', 'Leominster', 'Bozeman', 'Perth Amboy', 'Ontario', 'Rancho Cucamonga', 'Moorhead', 'Mesquite', 'Stockton', 'Ormond Beach', 'Sunnyvale', 'York', 'College Station', 'Saint Louis', 'Manteca', 'San Angelo', 'Salt Lake City', 'Knoxville', 'Little Rock', 'Lincoln Park', 'Marion', 'Littleton', 'Bangor', 'Southaven', 'New Castle', 'Midland', 'Sioux Falls', 'Fort Collins', 'Clarksville', 'Sacramento', 'Thousand Oaks', 'Malden', 'Holyoke', 'Albuquerque', 'Sparks', 'Coachella', 'Elmhurst', 'Passaic', 'North Charleston', 'Newport News', 'Jamestown', 'Mishawaka', 'La Quinta', 'Tallahassee', 'Nashville', 'Bellingham', 'Woodstock', 'Haltom City', 'Wheeling', 'Summerville', 'Hot Springs', 'Englewood', 'Las Cruces', 'Hoover', 'Frisco', 'Vacaville', 'Waukesha', 'Bakersfield', 'Pompano Beach', 'Corpus Christi', 'Redondo Beach', 'Orlando', 'Orange', 'Lake Charles', 'Highland Park', 'Hempstead', 'Noblesville', 'Apple Valley', 'Mount Pleasant', 'Sterling Heights', 'Eau Claire', 'Pharr', 'Billings', 'Gresham', 'Chattanooga', 'Meridian', 'Bolingbrook', 'Maple Grove', 'Woodland', 'Missouri City', 'Pearland', 'San Mateo', 'Grand Rapids', 'Visalia', 'Overland Park', 'Temecula', 'Yucaipa', 'Revere', 'Conroe', 'Tinley Park', 'Dubuque', 'Dearborn Heights', 'Santa Fe', 'Hickory', 'Carol Stream', 'Saint Cloud', 'North Miami', 'Plantation', 'Port Saint Lucie', 'Rock Hill', 'Odessa', 'West Allis', 'Chula Vista', 'Manhattan', 'Altoona', 'Thornton', 'Champaign', 'Texarkana', 'Edinburg', 'Baytown', 'Greenwood', 'Woonsocket', 'Superior', 'Bedford', 'Covington', 'Broken Arrow', 'Miramar', 'Hollywood', 'Deer Park', 'Wichita', 'Mcallen', 'Iowa City', 'Boise', 'Cranston', 'Port Arthur', 'Citrus Heights', 'The Colony', 'Daytona Beach', 'Bullhead City', 'Portage', 'Fargo', 'Elkhart', 'San Gabriel', 'Margate', 'Sandy Springs', 'Mentor', 'Lawton', 'Hampton', 'Rome', 'La Crosse', 'Lewiston', 'Hattiesburg', 'Danville', 'Logan', 'Waterbury', 'Athens', 'Avondale', 'Marietta', 'Yuma', 'Wausau', 'Pasco', 'Oak Park', 'Pensacola', 'League City', 'Gaithersburg', 'Lehi', 'Tuscaloosa', 'Moreno Valley', 'Georgetown', 'Loveland', 'Chandler', 'Helena', 'Kirkwood', 'Waco', 'Frankfort', 'Bethlehem', 'Grand Island', 'Woodbury', 'Rogers', 'Clovis', 'Jupiter', 'Santa Barbara', 'Cedar Hill', 'Norfolk', 'Draper', 'Ann Arbor', 'La Mesa', 'Pocatello', 'Holland', 'Milford', 'Buffalo Grove', 'Lake Forest', 'Redding', 'Chico', 'Utica', 'Conway', 'Cheyenne', 'Owensboro', 'Caldwell', 'Kenner', 'Nashua', 'Bartlett', 'Redwood City', 'Lebanon', 'Santa Maria', 'Des Plaines', 'Longview', 'Hendersonville', 'Waterloo', 'Cambridge', 'Palatine', 'Beverly', 'Eugene', 'Oxnard', 'Renton', 'Glenview', 'Delray Beach', 'Commerce City', 'Texas City', 'Wilson', 'Rio Rancho', 'Goldsboro', 'Montebello', 'El Cajon', 'Beaumont', 'West Palm Beach', 'Abilene', 'Normal', 'Saint Charles', 'Camarillo', 'Hillsboro', 'Burbank', 'Modesto', 'Garden City', 'Atlantic City', 'Longmont', 'Davis', 'Morgan Hill', 'Clifton', 'Sheboygan', 'East Point', 'Rapid City', 'Andover', 'Kissimmee', 'Shelton', 'Danbury', 'Sanford', 'San Marcos', 'Greeley', 'Mansfield', 'Elyria', 'Twin Falls', 'Coral Gables', 'Romeoville', 'Marlborough', 'Laurel', 'Bryan', 'Pine Bluff', 'Aberdeen', 'Hagerstown', 'East Orange', 'Arlington Heights', 'Oswego', 'Coon Rapids', 'San Clemente', 'San Luis Obispo', 'Springdale', 'Lodi', 'Mason']

531

In [15]:
#Unique levels in the Segment variable
store['Segment'].unique()

array(['Consumer', 'Corporate', 'Home Office'], dtype=object)

# Filter

In [16]:
#filter the data
#Filter the data by segments are consumer
#logical indexation [data[logical condition]]
#query method [data.query('logical condition')]

In [17]:
#logical indexation
store[store['Segment']=='Consumer'].head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [18]:
#query method
store.query('Segment=="Consumer"').head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [19]:
#Multiple conditions
#how many orders were placed for region south and for segment consumer
#data[(l1)&(l2)&(l3)]
#data[(l1)|(l2)]
store[(store['Region']=="South") & (store['Segment']=="Consumer")].shape[0]

838

In [20]:
#data.query('l1 & l2')
store.query('Region=="South" & Segment=="Consumer"').shape[0]

838

In [21]:
#find how many transactions from region south had a profit >$50
#find how many transactions from region south had a profit >$50
store.query('Region=="South" & Profit>50').shape[0]
#store[(store['Region'] =="South") & (store['Profit']>50)].shape[0]

323

In [22]:
# In class exercise :
#Write a code snippet to find out how many instances of packages delivered to Los Angeles
store.query('City=="Los Angeles"').shape[0]

747

In [23]:
# How many times orders were shipped to the east region ?
store.query('Region=="East"').shape[0]

2848

In [24]:
# How to figure out the total quantity of products shipped to the east zone ?
store.query('Region=="East"')['Quantity'].sum() # This will give us only the quantity column values
#store.query('Region=="East"').sum()

10618

# Sorting

In [25]:
#sorting the data
#sort_values() method to sort the values
#sort data by profit
store.sort_values("Profit").head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
7772,7773,CA-2013-108196,11/26/2013,12/3/2013,Standard Class,CS-12505,Cindy Stewart,Consumer,United States,Lancaster,...,43130,East,TEC-MA-10000418,Technology,Machines,Cubify CubeX 3D Printer Double Head Print,4499.985,5,0.7,-6599.9780
683,684,US-2014-168116,11/5/2014,11/5/2014,Same Day,GT-14635,Grant Thornton,Corporate,United States,Burlington,...,27217,South,TEC-MA-10004125,Technology,Machines,Cubify CubeX 3D Printer Triple Head Print,7999.980,4,0.5,-3839.9904

In [26]:
#descending order
store.sort_values("Profit",ascending=False).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
6826,6827,CA-2013-118689,10/3/2013,10/10/2013,Standard Class,TC-20980,Tamara Chand,Corporate,United States,Lafayette,...,47905,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
8153,8154,CA-2014-140151,3/24/2014,3/26/2014,First Class,RB-19360,Raymond Buch,Consumer,United States,Seattle,...,98115,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [27]:
#class exercise
## Sorting data
# Which are the most valuable customers in South Region by Sales?
store.query("Region=='South'").sort_values('Sales',ascending=False).head(2)
#store[store['Region']=='South'].sort_values('Sales',ascending=False).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
2697,2698,CA-2011-145317,3/18/2011,3/23/2011,Standard Class,SM-20320,Sean Miller,Home Office,United States,Jacksonville,...,32216,South,TEC-MA-10002412,Technology,Machines,Cisco TelePresence System EX90 Videoconferenci...,22638.48,6,0.5,-1811.0784
8488,8489,CA-2013-158841,2/2/2013,2/4/2013,Second Class,SE-20110,Sanjit Engle,Consumer,United States,Arlington,...,22204,South,TEC-MA-10001127,Technology,Machines,HP Designjet T520 Inkjet Large Format Printer ...,8749.95,5,0.0,2799.9840

In [28]:
#sort by two variables
store.sort_values(['Profit','Sales'],ascending=[False,True]).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
6826,6827,CA-2013-118689,10/3/2013,10/10/2013,Standard Class,TC-20980,Tamara Chand,Corporate,United States,Lafayette,...,47905,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
8153,8154,CA-2014-140151,3/24/2014,3/26/2014,First Class,RB-19360,Raymond Buch,Consumer,United States,Seattle,...,98115,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [29]:
# class exercise
#How to identify the top 10 customers in the south region (top 10 in terms of sale amount,discount ) ?
#Give only customer name 
store.query("Region=='South'").sort_values(['Sales','Discount'],ascending=[False,True])['Customer Name'].head(10)

2697             Sean Miller
8488            Sanjit Engle
683           Grant Thornton
509     Christopher Martinez
4297         Patrick O'Brill
9639             Joseph Holt
3280            Greg Maxwell
7583        Kristen Hastings
4093         Katrina Willman
1454            Mark Cousins
Name: Customer Name, dtype: object

In [30]:
#Add Customer Id also
store.query("Region=='South'").sort_values(['Sales','Discount'],ascending=[False,True])[['Customer Name','Customer ID']].head(10)

             Customer Name Customer ID
2697           Sean Miller    SM-20320
8488          Sanjit Engle    SE-20110
683         Grant Thornton    GT-14635
509   Christopher Martinez    CM-12385
4297       Patrick O'Brill    PO-18850
9639           Joseph Holt    JH-15985
3280          Greg Maxwell    GM-14695
7583      Kristen Hastings    KH-16690
4093       Katrina Willman    KW-16435
1454          Mark Cousins    MC-17425

In [31]:
# In the East Region who are the most profitable customers? Top 10.(in terms of Sales)

In [32]:
#In class exercise : Figure out the bottom 3 (least ranked customers based on the sale amount) for all the zones
store.sort_values('Sales')[['Region','Sales']].head(3)

       Region  Sales
4101  Central  0.444
9292  Central  0.556
8658  Central  0.836

In [33]:
store.sort_values('Sales',ascending=False)[['Region','Sales']].tail(3)

       Region  Sales
8658  Central  0.836
9292  Central  0.556
4101  Central  0.444

# Group By
# Groupby task(split the data into groups based on some criteria)

In [34]:
# I need the sum of the sale amount for each state 
state_group=store.groupby('State',as_index=False) # Already we have done the group by 
#store.groupby('State').reset_index()
# Here as_index=False/ reset_index()method represent don't keep State variable as index
state_group

#agg method

In [35]:
sales_sum = state_group.agg({"Sales":'sum' }).head()

In [36]:
sales_sum

        State        Sales
0     Alabama   19510.6400
1     Arizona   35282.0010
2    Arkansas   11678.1300
3  California  457687.6315
4    Colorado   32108.1180

In [37]:
store.groupby('State',as_index=False).agg({'Sales':np.sum}).head()

        State        Sales
0     Alabama   19510.6400
1     Arizona   35282.0010
2    Arkansas   11678.1300
3  California  457687.6315
4    Colorado   32108.1180

In [38]:
store.groupby('State').agg({'Sales':np.sum,'Profit':np.max}).head()

                  Sales     Profit
State
Alabama      19510.6400  1459.2000
Arizona      35282.0010   211.4955
Arkansas     11678.1300   843.1706
California  457687.6315  1906.4850
Colorado     32108.1180   247.9960

In [39]:
store.groupby('State').agg({'Sales':np.sum,'Profit':np.mean}).reset_index().head()

        State        Sales     Profit
0     Alabama   19510.6400  94.865989
1     Arizona   35282.0010 -15.303235
2    Arkansas   11678.1300  66.811452
3  California  457687.6315  38.171608
4    Colorado   32108.1180 -35.867351

In [40]:
store.groupby(['State','City']).agg({'Sales':'max','Profit':np.mean}).reset_index().head()

     State        City    Sales      Profit
0  Alabama      Auburn   900.08   75.434517
1  Alabama     Decatur  1215.92   76.929854
2  Alabama    Florence  1819.86   49.731780
3  Alabama      Hoover   477.24    4.679325
4  Alabama  Huntsville  1319.96  100.525720

In [41]:
store.groupby(['State','City']).agg({'Sales':'max','Profit':np.mean}).head(2)

                   Sales     Profit
State   City
Alabama Auburn    900.08  75.434517
        Decatur  1215.92  76.929854

In [42]:
#Filter the data by East Region, find the maximum sales by State wise
store.query('Region=="East"').groupby('State').agg({'Sales':'max'})

                          Sales
State
Connecticut            1133.350
Delaware              10499.970
District of Columbia   1379.920
Maine                   437.850
Maryland               2541.980
Massachusetts          1737.180
New Hampshire          2249.910
New Jersey             9099.930
New York              11199.968
Ohio                   4499.985
Pennsylvania           8399.976
Rhode Island           5399.910
Vermont                4404.900
West Virginia           673.344

In [43]:
store.query('Region=="East"').groupby('State').agg({'Sales':'max'}).sort_values('Sales',ascending=False)

                          Sales
State
New York              11199.968
Delaware              10499.970
New Jersey             9099.930
Pennsylvania           8399.976
Rhode Island           5399.910
Ohio                   4499.985
Vermont                4404.900
Maryland               2541.980
New Hampshire          2249.910
Massachusetts          1737.180
District of Columbia   1379.920
Connecticut            1133.350
West Virginia           673.344
Maine                   437.850

In [44]:
store.query('Region=="East"').groupby('State')['Sales','Profit'].agg(['mean','max']).head(3)

                           Sales                Profit
                            mean       max        mean        max
State
Connecticut           163.223866   1133.35   42.823071   294.6710
Delaware              285.948635  10499.97  103.930988  5039.9856
District of Columbia  286.502000   1379.92  105.958930   648.5624

In [45]:
# What is the average quantity sold by region?
store.groupby('Region').agg({'Quantity':'mean'})

         Quantity
Region
Central  3.779595
East     3.728230
South    3.832716
West     3.829535

In [46]:
#Find average profit by region
store.groupby("Region").agg({'Profit':'mean'})

            Profit
Region
Central  17.092709
East     32.135808
South    28.857673
West     33.849032

In [47]:
#Find out the top 5 states in terms of sale amount 
store.groupby('State').agg({'Sales':'max'}).sort_values("Sales",ascending=False).head()

                Sales
State
Florida     22638.480
Indiana     17499.950
Washington  13999.960
New York    11199.968
Delaware    10499.970

# Renaming the columns

In [48]:
store.groupby("Segment",as_index=False).agg({'Discount':np.mean}).rename(columns={"Discount":"Average Discount"})

       Segment  Average Discount
0     Consumer          0.158141
1    Corporate          0.158228
2  Home Office          0.147128

In [49]:
#Rename Salesas "Average Sales"
store.groupby("Segment",as_index=False).agg({'Discount':np.mean,'Sales':'max'}).rename(columns={"Discount":"Average Discount",
                                                                                                'Sales':'Max Sales'})

       Segment  Average Discount  Max Sales
0     Consumer          0.158141   13999.96
1    Corporate          0.158228   17499.95
2  Home Office          0.147128   22638.48

In [50]:
#Which segment of customers get the max discount in terms of discount percentage per segment 
data1=store.groupby("Segment",as_index=False).agg({'Discount':np.max})
print(store.groupby("Segment",as_index=False).agg({'Discount':np.max}).shape[0]/store.shape[0])
print(data1['Discount']/data.shape[0])

0.0003001801080648389

NameError: name 'data' is not defined

In [ ]:
# What are the top 5 categories that give maximum profit?
store.groupby("Category",as_index=False).agg({"Profit":np.max}).sort_values("Profit",ascending=False)

# Adding new columns

In [ ]:
## Adding new columns
# Comparing Sales per order with the average sales? 
store["Hi_Low"]=(store['Sales'])/(store['Sales'].mean())
store.head(2)

In [ ]:
#Create Cost price variable
store["Cost"]=(store['Sales'])-(store['Profit'])

# Apply method in a data frame

In [ ]:
#Apply method
# What is the Total Sales, Quantity, Discount, Profit across Total US.
def get_sum(x):
    return np.sum(x)  # In this function we were finding out the sum of all column values 

store[["Sales","Quantity","Discount","Profit"]].apply(get_sum,axis=0) #axis=0 Function is to be applied on each column on data.
                                                                      #along the rows

# map function

In [58]:

def new(x):
    if x>3000:
        return 'High'
    elif 1000<x<3000:
        return 'Middle'
    else:
        return 'Low'
store['Salesnew']=store['Sales'].map(new)
#store['Sales'].apply(new)

In [ ]:
def flag(df):
    if df['duration']=="5 days" and df['Sales']<=3000:
        return 1
    else:
        return 0
store['label']=store.apply(df,axis=1)

In [ ]:
store['profit_flag'] = (store['Profit'] > 5000).map({True:'HIGH', False:'LOW'})

store.head(2)

# Working with date time functions 

datetime is a data type in pandas

In [ ]:
## Datetime
# Find how much time it takes to place an order and ship the product
#to_datetime() helps to convert an object into date object
store['Order Date']=pd.to_datetime(store['Order Date'])
store['Ship Date']=pd.to_datetime(store['Ship Date'])

In [ ]:
store['duration']=store['Ship Date']-store['Order Date']
store.head(2)

In [ ]:
# How many times has it taken more than 5 days from placing an order to shipping
store[store['duration']>'5 days'].shape[0]

In [ ]:
# What is the probability of shipping time exceeting 5 days 
store[store['duration']>'5 days'].shape[0]/store.shape[0]

In [ ]:
# What are the product category for which the shipping time is greater than 5 days 
store[store['duration']>'5 days'].groupby("Category").agg({"Category":'size'})

In [ ]:
#Which are the cities to which the shipping time is 1 day (Display only the cities)
store[store['duration']=='1 day']['City'].head()
#store[store['duration']=='1 day'].groupby("City").agg({"City":'size'})

In [ ]:
#Changing date formats
store["Ship Date"].dt.strftime("%d/%m/%Y").head(2)

#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Period.strftime.html
%b- 1st three characters of the month name
%d- day of the month
%Y- year in four digit format
%H- hour
%M- minute
%S- second
%a- 1st three characters of the weekday
%A- ful name of the weekday
%B- full name of the month
%w- weekday as a number (0 to 6)
%m-month as a number
%y- year in two digit format

In [ ]:
store['Order Date'].dt.strftime('%y-%m-%d %H:%M').head(2)

In [ ]:
df = pd.DataFrame() 
# Create 6 dates 
df['time'] = pd.date_range('2/5/2019', periods = 6, freq ='2H')#H:hours,T:minutes,S:seconds,M:months;D:days,Y:years 
print(df['time'])

In [ ]:
#Extract features - year, month, day, hour, and minute 
df['year'] = df['time'].dt.year 
df['month'] = df['time'].dt.month 
df['day'] = df['time'].dt.day 
df['hour'] = df['time'].dt.hour 
df['minute'] = df['time'].dt.minute
print(df)
#Extract days of week and then print 
#weekday returns numerical value: 0-'monday', 6-'sunday'
#print(df['Time'].dt.weekday)
print(df['time'].dt.weekday_name)

# Combining data frames using concat function

In [ ]:
data1=pd.read_csv("Sales_Sep.csv")
data2=pd.read_csv("Sales_Oct.csv")

In [ ]:
data1.head(5)
data1.shape[0]

In [ ]:
data2.head(5)
data2.shape[0]

In [ ]:
# Concatenate 
row_concat = pd.concat([data1, data2])
row_concat.head(22)

In [ ]:
#export a file to working directory
row_concat.to_csv("D://Files//newfile.csv")

# Combining data frames using merge function

In [ ]:
## Merging DataFrames
df1=pd.DataFrame({'CustomerID':[1,2,3,4,5,6],'Product':['Television','Television','Television',
                                                        'Earphones','Earphones','Earphones']})
df2=pd.DataFrame({'CustomerID':[2,4,6],'State':['Texas','Texas','Seattle']})

In [ ]:
df1.head(2)

In [ ]:
df2.head(2)

In [ ]:
#outer join:Every records will appear
#pd.merge(df1, df2, how='outer',on='CustomerID')
pd.merge(data1,data2,how='outer',on='Cust_ID')

In [ ]:
#inner join: only matcing records will appear
#pd.merge(df1,df2,how='inner',on='CustomerID')
pd.merge(data1,data2,how='inner',on='Cust_ID')

In [ ]:
#pd.merge(df1,df2,how='left',on='CustomerID')
pd.merge(data1,data2,how='left',on='Cust_ID')
#left merge:
#Data frame df1 will be keep as it as and on the basis of common variable merge dataframe df2

In [ ]:
#right join: df2 will be keep as it is and on the basis of common variable merge data frame df1
#pd.merge(df1,df2,how='right',on='CustomerID')
pd.merge(data1,data2,how='right',on='Cust_ID')

In [ ]:
#drop a column
data1.drop('Cust_ID',axis=1)
#axis=1:along the columns

# Working with string manipulation functions

In [ ]:
st=pd.read_csv("Strings.csv")

In [ ]:
st.head(2)

In [ ]:
# We cannot directly apply mean funtion on the income column of the above data frame as the income 
# column is stored as a string type and not a numeric type. 
st['Income_M'].mean()

In [ ]:
st['Income_M']=st['Income_M'].str.replace("Rs","")
print (st.head(2))

In [ ]:
st['Income_M']=st['Income_M'].str.replace("/-","")
print (st.head(2))

In [ ]:
st.Income_M=pd.to_numeric(st.Income_M)

In [ ]:
st['Income_M'].mean()

# Handling Character data using dummies

In [ ]:
dat=pd.read_csv("medal.csv", encoding="latin")
dat.head(2)

In [ ]:
dummies = pd.get_dummies(dat)

In [ ]:
dummies.head(3)

# Handling missing values

In [ ]:
# Counting the number of missing values in each column

dat_m=pd.read_csv('D://Files//credit_history.csv',
                  na_values=['Missing',""])
# If there are any blank spaces or keyword Missing in the 
#source CSV file, they will be replaced with NAN

In [ ]:
dat_m.isnull().sum()

In [ ]:
#summary statistics for 'Year' variable
dat_m['years'].describe()

In [ ]:
#Replacing missing values
#dat_m['years']=dat_m['years'].fillna(np.median(dat_m['years']))
dat_m['years']=dat_m['years'].fillna(dat_m['years'].median())
#dat_m['years']=dat_m['years'].fillna(4)

In [ ]:
dat_m['years'].median()

# Reshaping data frames 
https://pythonhealthcare.org/2018/04/08/32-reshaping-pandas-data-with-stack-unstack-pivot-and-melt/

In [ ]:
# Unsterstanding STACK operation
df_stacked = dat_m.stack()
print(df_stacked)

In [ ]:
# Understanding the unstacked operation 
df_unstacked = df_stacked.unstack()
print(df_unstacked)

# pivot table
pandas.pivot(index, columns, values) function produces pivot table based on 3 columns of the DataFrame.

Uses unique values from index / columns and fills with values.

Python Pandas function pivot_table help us with the summarization and conversion of dataframe in long form to dataframe in wide form, in a variety of complex scenarios.

In [54]:
data_url = 'http://bit.ly/2cLzoxH'
gapminder = pd.read_csv(data_url)
print(gapminder.head(3))

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

In [55]:
pd.pivot_table(gapminder,index='country', values='lifeExp',columns='continent').head()

continent       Africa   Americas       Asia     Europe  Oceania
country
Afghanistan        NaN        NaN  37.478833        NaN      NaN
Albania            NaN        NaN        NaN  68.432917      NaN
Algeria      59.030167        NaN        NaN        NaN      NaN
Angola       37.883500        NaN        NaN        NaN      NaN
Argentina          NaN  69.060417        NaN        NaN      NaN

In [56]:
df1 = gapminder[['continent', 'year','lifeExp']]
# pivot table example with three columns
pd.pivot_table(df1, values='lifeExp', index=['year'], columns='continent').head()

continent     Africa  Americas       Asia     Europe  Oceania
year
1952       39.135500  53.27984  46.314394  64.408500   69.255
1957       41.266346  55.96028  49.318544  66.703067   70.295
1962       43.319442  58.39876  51.563223  68.539233   71.085
1967       45.334538  60.41092  54.663640  69.737600   71.310
1972       47.450942  62.39492  57.319269  70.775033   71.910

More use cases of the pivot_table function could be used

https://pbpython.com/pandas-pivot-table-explained.html

#cross tab cross tabulation is a method to quantitatively analyze the relationship between multiple variables

In [51]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
d = {
    'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Result':['Pass','Pass','Fail','Pass','Fail','Pass','Pass','Fail','Fail','Pass','Pass','Fail']}
 
df = pd.DataFrame(d,columns=['Name','Exam','Subject','Result'])

# 2 Way Cross table in python pandas:

In [52]:
#calculate the cross table of subject and result
pd.crosstab(df.Subject, df.Result,margins=True)
#margin=True displays the row wise and column wise sum of the cross table

Result       Fail  Pass  All
Subject
Mathematics     3     3    6
Science         2     4    6
All             5     7   12

In [53]:
#3 Way Cross table in python pandas:
pd.crosstab([df.Subject, df.Exam],df.Result, margins=True)

Result                  Fail  Pass  All
Subject     Exam
Mathematics Semester 1     1     2    3
            Semester 2     2     1    3
Science     Semester 1     1     2    3
            Semester 2     1     2    3
All                        5     7   12